"""parse  模块"""
import urllib.parse


'''
1.解析

导入方式:
    import urllib.parse
'''

print('1.')
print('——————————————————————————————————————————————————')

print('1.')

print('——————————————————————————————————————————————————')
print('\n')


'''
2.urlencode()

字符串元素的字典转换成 application 格式

参数:
    query: 字符串元素的字典

返回的对象的可使用方法:
    encode()  按编码转换字节
        参数:
            encoding: 编码格式
'''

print('2.')
print('——————————————————————————————————————————————————')

print('1.')

print('——————————————————————————————————————————————————')
print('\n')
