"""request  模块"""
import urllib.request


'''
1.向网址爬取数据的模块

导入方式:
    import urllib.request
'''

print('1.')
print('——————————————————————————————————————————————————')

print('1.')

print('——————————————————————————————————————————————————')
print('\n')


'''
2.urlopen()

使用默认 opener，传入网址，返回一个对象

参数:
    url: 网址
    data=None:
        默认以 get 获取数据，填写 application 参数后以 post 获取数据

返回的对象的可供使用的方法:
    read()  转换成二进制字节数据类型
'''

print('2.')
print('——————————————————————————————————————————————————')

print('1.')

print('——————————————————————————————————————————————————')
print('\n')


'''
3.Request()

整合

参数:
    url: 网址
    data=None: application 格式的数据
    headers={}: 标头，传入一个字典

返回该类对象，可作为 urlopen() 的 url 参数
返回的对象的可使用方法属性:
    headers  一个字典，返回 headers
    add_header()  添加 header
        参数:
            key: 键
            val: 值
'''

print('3.')
print('——————————————————————————————————————————————————')

print('1.')

print('——————————————————————————————————————————————————')
print('\n')


'''
4.ProxyHandler()

创建管理者代理人

参数:
    {}: 字典，键是类型('https', ...)，值是 '代理ip:端口号'
'''

print('4.')
print('——————————————————————————————————————————————————')

print('1.')

print('——————————————————————————————————————————————————')
print('\n')


'''
5.build_opener() install_opener()

开启者

build_opener()  创建 opener，临时的
    参数:
        handlers: 管理者，ProxyHandle() 创建管理者
    返回的对象的可使用方法属性:
        open()  打开网址，开爬
            参数:
                url: 网址
        addheaders  添加标头，一个元组元素的列表的变量
            赋值:
                [('User-Agent', 'hander')]
                元组中第二个变量就是要添加的标头
install_opener()  安装 opener，之后可用普通的方式打开
    修改变量的形式安装，不是永久安装到系统
    参数:
        opener: 开启者
'''

print('5.')
print('——————————————————————————————————————————————————')

print('1.')

print('——————————————————————————————————————————————————')
print('\n')
